import string
from datetime import datetime
import time

def bruteforce_password(current_password, password_length, characters, counter):
    if len(current_password) == password_length:
        print("Пароль:", current_password)
        counter += 1

        if (real_password == current_password):
            print("Пароль найден!")
            print("Время работы:  ", datetime.now() - start_time)
            time.sleep(999)
            exit(1999)
        return

    # Перебор всех символов из заданного набора для следующей позиции в пароле
    for char in characters:
        # Рекурсивный вызов функции с увеличением длины пароля и новым символом
        bruteforce_password(current_password + char, password_length, characters, counter)

def bruteforce():
    characters = string.digits + string.ascii_letters + string.punctuation
    global real_password
    print('''________________________________________________________
░█████╗░████████╗████████╗░█████╗░░█████╗░██╗░░██╗
██╔══██╗╚══██╔══╝╚══██╔══╝██╔══██╗██╔══██╗██║░██╔╝
███████║░░░██║░░░░░░██║░░░███████║██║░░╚═╝█████═╝░
██╔══██║░░░██║░░░░░░██║░░░██╔══██║██║░░██╗██╔═██╗░
██║░░██║░░░██║░░░░░░██║░░░██║░░██║╚█████╔╝██║░╚██╗
╚═╝░░╚═╝░░░╚═╝░░░░░░╚═╝░░░╚═╝░░╚═╝░╚════╝░╚═╝░░╚═╝

██╗███╗░░░███╗██╗████████╗░█████╗░████████╗██╗░█████╗░███╗░░██╗
██║████╗░████║██║╚══██╔══╝██╔══██╗╚══██╔══╝██║██╔══██╗████╗░██║
██║██╔████╔██║██║░░░██║░░░███████║░░░██║░░░██║██║░░██║██╔██╗██║
██║██║╚██╔╝██║██║░░░██║░░░██╔══██║░░░██║░░░██║██║░░██║██║╚████║
██║██║░╚═╝░██║██║░░░██║░░░██║░░██║░░░██║░░░██║╚█████╔╝██║░╚███║
╚═╝╚═╝░░░░░╚═╝╚═╝░░░╚═╝░░░╚═╝░░╚═╝░░░╚═╝░░░╚═╝░╚════╝░╚═╝░░╚══╝

██████╗░██████╗░░█████╗░░░░░░██╗███████╗░█████╗░████████╗
██╔══██╗██╔══██╗██╔══██╗░░░░░██║██╔════╝██╔══██╗╚══██╔══╝
██████╔╝██████╔╝██║░░██║░░░░░██║█████╗░░██║░░╚═╝░░░██║░░░
██╔═══╝░██╔══██╗██║░░██║██╗░░██║██╔══╝░░██║░░██╗░░░██║░░░
██║░░░░░██║░░██║╚█████╔╝╚█████╔╝███████╗╚█████╔╝░░░██║░░░
╚═╝░░░░░╚═╝░░╚═╝░╚════╝░░╚════╝░╚══════╝░╚════╝░░░░╚═╝░░░
________________________________________________________
Введите пароль, чтобы проверить его стойкость...
Метод: брутфорс
________________________________________________________
    ''')
    real_password = input("Введите пароль: ")
    global start_time
    start_time = datetime.now()
    bruteforce_password("", 8, characters, 0)

bruteforce()